En este notebook se crea el dataframe para el ejercicio por motivos de peso de los datos fueron eliminados los datos originales cuando se obtuvieron los datos de cada año de una sola estacion del sur este de Francia. si se intenta correr el script con los recursos del repositorio se generara el error sin embargo se deja para evidenciar como se armo el dataframe que se debe limpiar.

In [1]:
#librerias
import pandas as pd
import os

In [14]:
#Usar os para las rutas y permitir compatibilidad con todos los SO 
#raw_data_path = os.path.join('..', 'data', 'SE2016.csv')
#raw_data_df = pd.read_csv(raw_data_path, header= 0)

In [16]:
print(raw_data_df.shape)
raw_data_df.head()

(42368865, 12)

,number_sta,lat,lon,height_sta,date,dd,ff,precip,hu,td,t,psl
0,1027003,45.83,5.11,196.0,20160101 00:00,NaN,NaN,NaN,98.0,278.75,279.05,NaN
1,1033002,46.09,5.81,350.0,20160101 00:00,0.0,0.0,0.0,99.0,278.25,278.35,NaN
2,1034004,45.77,5.69,330.0,20160101 00:00,0.0,0.0,0.0,100.0,279.15,279.15,NaN
3,1072001,46.20,5.29,260.0,20160101 00:00,NaN,NaN,0.0,NaN,NaN,276.55,NaN
4,1089001,45.98,5.33,252.0,20160101 00:00,0.0,0.0,0.0,95.0,278.85,279.55,102720.0

#### Escogamos una estación aleatoria: En este caso la 1034004

In [19]:
station_data_df = raw_data_df[raw_data_df['number_sta'] == 1034004]
print(station_data_df.shape)
station_data_df.head()

(87698, 12)

,number_sta,lat,lon,height_sta,date,dd,ff,precip,hu,td,t,psl
2,1034004,45.77,5.69,330.0,20160101 00:00,0.0,0.0,0.0,100.0,279.15,279.15,NaN
485,1034004,45.77,5.69,330.0,20160101 00:06,0.0,0.0,0.0,100.0,279.05,279.05,NaN
968,1034004,45.77,5.69,330.0,20160101 00:12,0.0,0.0,0.0,100.0,278.85,278.85,NaN
1452,1034004,45.77,5.69,330.0,20160101 00:18,0.0,0.0,0.0,100.0,278.85,278.85,NaN
1936,1034004,45.77,5.69,330.0,20160101 00:24,0.0,0.0,0.0,100.0,278.85,278.85,NaN

## Crear un dataset con los datos filtrados

In [20]:
raw_dataset_save_path = os.path.join('..', 'data', 'single_station_data.csv')
station_data_df.to_csv(raw_dataset_save_path, index= False)

## Unir el dataset con los años 2017 y 2018

In [8]:
#data_2017 = pd.read_csv(os.path.join('..', 'data', 'SE2017.csv'))
#data_2018 = pd.read_csv(os.path.join('..', 'data', 'SE2018.csv'))

In [9]:
#data_2017.head()

,number_sta,lat,lon,height_sta,date,dd,ff,precip,hu,td,t,psl
0,1027003,45.83,5.11,196.0,20170101 00:00,NaN,NaN,NaN,99.0,272.75,272.85,NaN
1,1033002,46.09,5.81,350.0,20170101 00:00,20.0,0.9,0.0,94.0,269.75,270.55,NaN
2,1034004,45.77,5.69,330.0,20170101 00:00,30.0,1.8,0.0,100.0,271.45,271.45,NaN
3,1072001,46.20,5.29,260.0,20170101 00:00,NaN,NaN,0.0,NaN,NaN,270.55,NaN
4,1089001,45.98,5.33,252.0,20170101 00:00,170.0,0.9,0.0,98.0,270.55,270.85,103150.0

In [10]:
#data_2018.head()

,number_sta,lat,lon,height_sta,date,dd,ff,precip,hu,td,t,psl
0,1027003,45.83,5.11,196.0,20180101 00:00,NaN,NaN,NaN,90.0,279.15,280.65,NaN
1,1033002,46.09,5.81,350.0,20180101 00:00,30.0,2.7,0.2,89.0,277.65,279.35,NaN
2,1034004,45.77,5.69,330.0,20180101 00:00,190.0,1.4,0.0,86.0,278.25,280.45,NaN
3,1072001,46.20,5.29,260.0,20180101 00:00,NaN,NaN,0.0,NaN,NaN,280.25,NaN
4,1089001,45.98,5.33,252.0,20180101 00:00,130.0,1.3,0.0,94.0,279.75,280.65,101760.0

In [11]:
#filtered_2017 = data_2017[data_2017['number_sta'] == 1034004]
#filtered_2018 = data_2018[data_2018['number_sta'] == 1034004]

In [12]:
#print(filtered_2017.shape, filtered_2018.shape)

(87579, 12) (87573, 12)

In [13]:
#filtered_2016 = pd.read_csv(os.path.join('..', 'data', 'single_station_data.csv'))

In [14]:
#filtered_2016.head()

,number_sta,lat,lon,height_sta,date,dd,ff,precip,hu,td,t,psl
0,1034004,45.77,5.69,330.0,20160101 00:00,0.0,0.0,0.0,100.0,279.15,279.15,NaN
1,1034004,45.77,5.69,330.0,20160101 00:06,0.0,0.0,0.0,100.0,279.05,279.05,NaN
2,1034004,45.77,5.69,330.0,20160101 00:12,0.0,0.0,0.0,100.0,278.85,278.85,NaN
3,1034004,45.77,5.69,330.0,20160101 00:18,0.0,0.0,0.0,100.0,278.85,278.85,NaN
4,1034004,45.77,5.69,330.0,20160101 00:24,0.0,0.0,0.0,100.0,278.85,278.85,NaN

In [15]:
#full_data = pd.concat([filtered_2016, filtered_2017, filtered_2018], axis= 0)

In [16]:
full_data.head()

,number_sta,lat,lon,height_sta,date,dd,ff,precip,hu,td,t,psl
0,1034004,45.77,5.69,330.0,20160101 00:00,0.0,0.0,0.0,100.0,279.15,279.15,NaN
1,1034004,45.77,5.69,330.0,20160101 00:06,0.0,0.0,0.0,100.0,279.05,279.05,NaN
2,1034004,45.77,5.69,330.0,20160101 00:12,0.0,0.0,0.0,100.0,278.85,278.85,NaN
3,1034004,45.77,5.69,330.0,20160101 00:18,0.0,0.0,0.0,100.0,278.85,278.85,NaN
4,1034004,45.77,5.69,330.0,20160101 00:24,0.0,0.0,0.0,100.0,278.85,278.85,NaN

In [17]:
full_data.tail()

,number_sta,lat,lon,height_sta,date,dd,ff,precip,hu,td,t,psl
43305697,1034004,45.769,5.688,330.0,20181231 23:30,350.0,0.6,0.0,93.0,274.65,275.65,NaN
43306221,1034004,45.769,5.688,330.0,20181231 23:36,350.0,0.6,0.0,93.0,274.65,275.65,NaN
43306745,1034004,45.769,5.688,330.0,20181231 23:42,320.0,0.6,0.0,94.0,274.75,275.65,NaN
43307269,1034004,45.769,5.688,330.0,20181231 23:48,330.0,0.6,0.0,94.0,274.95,275.85,NaN
43307793,1034004,45.769,5.688,330.0,20181231 23:54,0.0,0.0,0.0,94.0,274.95,275.85,NaN

In [18]:
full_data.to_csv(os.path.join('..', 'data', 'full_single_station_data.csv'))